  const cardData = [
    {
      name: 'ถั่วดินโคก',
      image: 'image/1.jpg',
      body: 'ยาสมุนไพรพื้นบ้านของจังหวัดอุบลราชธานี จะใช้รากพิษนาศน์ นำมาฝนกับน้ำดื่มเป็นยาช่วยลดไข้ในเด็ก ใช้ต้มกับน้ำดื่มเป็นยาบำรุงน้ำนมของสตรี (กินมากไม่ดี) ใช้ฝนทาแก้พิษงู (ต้องว่าคาถาด้วย) และใช้ลำต้น ราก เหง้า และใบนำมาฝนทาเป็นยาแก้ฝี'
    },
    {
      name: 'เทพทาโร',
      image: 'image/2.jpg',
      body: 'เทพทาโรเป็นพืชที่มีถิ่นกำเนิดในทวีปเอเชียเขตร้อนโดยพบว่า มีเขตการกระจายพันธุ์ ตั้งแต่ทิเบต มณฑลยูนานในจีน อินเดีย เทือกเขาตะนาวศรีในพม่า เวียดนาม คาบสมุทรอินโดจีน จนถึงแหลมมลายู ไทย มาเลเซีย สิงคโปร์ เกาะสุมาตรา รวมถึงเกาะอื่นๆ ในอินโดนีเซีย '
    },
    {
      name: 'มะตูมนิ่ม',
      image: 'image/3.jpg',
      body: 'มะตูมธรรมดา เป็นพันธุ์มะตูมที่พบมากที่สุด มีลักษณะเด่น คือ ผลมีขนาดใหญ่ เปลือกผลแข็งมาก ผลสุกเนื้อสีเหลืองหรือสีเหลืองอมส้ม และส่งกลิ่นหอม มะตูมไข่ มีลักษณะเด่น คือ ผลมีขนาดเล็ก ผลมีรูปทรงไข่ และที่วงการยาสมุนไพรมักนำมาทำยากันมาก '
    },
    {
      name: 'มะหาด',
      image: 'image/4.jfif',
      body: 'ตำรายาไทย ผงจากแก่น โดยนำแก่นไม้ที่อายุ 5 ปีขึ้นไป มาสับแล้วนำไปต้มเคี่ยวกับน้ำ จนเกิดฟอง ช้อนฟองที่ได้รวมกันทำให้แห้ง จะได้ผงสีขาวนวลจับกันเป็นก้อน นำไปย่างไฟให้เหลือง แล้วนำมาบดเป็นผง เรียกว่า “ผงปวกหาด” มีรสร้อนเมา นำมาชงกับน้ำเย็นรับประทาน '
    },
    {
      name: 'เร่ว',
      image: 'image/5.jpg',
      body: 'แก้อาการท้องอืดเฟ้อ ขับลมแน่นจุกเสียด นำเมล็ดในจากผลแก่มาบดเป็นผง รับประทานครั้งละ 1-3 กรัม (ประมาณ 3-9 ผล) วันละ 3 ครั้ง หลังอาหาร และในตำรายาไทย – จีน จะใช้เร่วน้อย และเร่วใหญ่ ขับลม บรรเทาอาการท้องเสีย และครรภ์รักษา แก้อาการอาเจียน แก้ไข้ แก้ไอ '
    },
    {
      name: 'หัวร้อยรู',
      image: 'image/6.jpg',
      body: 'ช้บำรุงหัวใจ แก้พิษประดง แก้พิษในข้อในกระดูก แก้ข้อเข่าเท้าบวม แก้ปวดศีรษะ บำรุงน้ำนมสตรีหลังคลอด โดยใช้หัวแห้งฝานเป็นแผ่นมาต้มกับน้ำดื่ม ใช้แก้เบาหวาน โดยนำหัวร้อยรูมาผสมกับต้นกำแพงเจ็ดชั้น หัวข้าวเย็นเหนือ หัวข้าวเย็นใต้ แก่นสัก หญ้ากันชาดทั้งต้น และรากทองพันชั่ง แล้วนำมาต้มเป็นน้ำดื่ม'
    },
    {
      name: 'กระทุ่มนา',
      image: 'image/7.webp',
      body: 'ยาแผนโบราณของไทยจะใช้ใบกระทุ่มนา (แทนใบกระท่อม) เป็นยาแก้ท้องร่วง ปวดมวนท้อง ซึ่งมีฤทธิ์เหมือนใบกระท่อม แต่อ่อนกว่า สามารถนำมาใช้แทนกันได้เปลือกต้นและใบใช้เป็นยาแก้บิดมูกเลือดเปลือกต้นมีรสฝาดร้อน ใช้เป็นยารักษาโรคผิวหนังทุกชนิด แก้มะเร็งคุดทะราด (เปลือกต้น)'
    },
    {
      name: 'ขันทองพยาบาท',
      image: 'image/8.jpg',
      body: 'รสเมาเบื่อร้อน แก้ลม แก้ประดง แก้พิษในกระดูก แก้โรคผิวหนัง รักษาน้ำเหลืองเสีย  เปลือกต้น รสเมาเบื่อ แก้โรคตับพิการ แก้ปอดพิการ แก้ลมเป็นพิษ แก้โรคผิวหนัง แก้กลากเกลื้อน รักษามะเร็ง รักษามะเร็งคุด เป็นยาถ่าย เป็นยาระบาย เป็นยาบำรุงเหงือก แก้เหงือกอักเสบ ทำให้เหงือกแข็งแรง ทำให้ฟันทน แก้ประดง '
    },
    {
      name: 'จุกโรหินี',
      image: 'image/9.jpg',
      body: 'ช่วยแก้หอบหืด (ราก) ช่วยแก้อาการอาเจียน (ใบ, ราก)ช่วยแก้เสมหะผิดปกติ เสมหะพิการ (ใบ, ราก)ผลนำมาดึงไส้ออก ใส่น้ำ นำไปเผาไฟให้อุ่น ใช้เป็นยาหยอดหู หรือจะนำผลมาเผาไฟเอาน้ำใช้หยอดหูน้ำหนวก (ผล)ผลนำมาผสมกับมดแดงฮ้าง ใช้ต้มกับน้ำดื่มเป็นยาแก้ลมพันไส้ (ผล)เถานำมาต้มกับน้ำดื่มจะช่วยขับลม '
    },
    {
      name: 'ชะเอมไทย',
      image: 'image/10.webp',
      body: 'ชะเอมไทยจัดเป็นส่วนผสมในตำรับยา “พิกัดทศกุลาผล” ซึ่งมีสรรพคุณช่วยแก้ไข้เพื่อดีและเสมหะ ช่วยบำรุงธาตุ บำรุงปอด บำรุงกำลัง บำรุงดวงจิตให้แช่มชื่น ช่วยแก้ไข้ แก้รัตตะปิตตะโรค ช่วยขับลมในลำไส้ แก้ลมอัมพฤกษ์และอัมพาต โดยเป็นตำรับยาที่มีการจำกัดจำนวนตัวยาในตระกูลเดียวกันทั้ง 10 อย่าง อันได้แก่ ชะเอมไทย,...'
    },
    {
      name: 'ชิงชี่',
      image: 'image/11.jpg',
      body: 'ทั้งต้นมีรสขื่นปร่า ใช้เป็นยาแก้ไข้ (ทั้งต้น)ใบนำมาต้มดื่มเป็นยาแก้ไข้สันนิบาต (คือไข้ที่มีอาการวิงเวียน ตาลาย เลือดกำเดาไหล แน่นหน้าอก เกิดขึ้นร่วมกัน) ไข้พิษฝีกาฬ (ฝีกาฬคือฝีที่เกิดบริเวณนิ้วมือ สีดำ ทำให้มีอาการปวดศีรษะและแสบร้อนมาก อาจทำให้แน่นิ่งไปได้) (ใบ)รากและใบช่วยกระทุ้งพิษไข้หัว '
    },
    {
      name: 'ตับเต่า',
      image: 'image/12.jpg',
      body: 'ใช้แก้ผิดสำแดง โดยนำเปลือกต้น ผสมกับลำต้นเฉียงพร้านางแอ และลำต้นหนามแทน นำมาต้มกับน้ำดื่มใช้รักษาโรคทางเดินปัสสาวะ โดยนำเปลือกต้นตับเต่าต้น ผสมกับรากขี้เหล็ก รากสลอด และรากหญ้าเรงชอน นำมาต้มกับน้ำดื่มใช้รักษาโรคมะเร็งในตับ โดยใช้เปลือกต้นและใบตับเต่าต้น ผสมกับลำต้นตับเต่าเครือ ใบหรือรากกล้วยเต่า และผักบุ้งร้วมทั้งต้น นำมาบดให้เป็นผงละเอียด ละลายกับน้ำร้อนดื่ม'
    },
    {
      name: 'นางแย้มป่า',
      image: 'image/13.jpg',
      body: 'ช้แก้ลำไส้อักเสบ ไตพิการ ขับปัสสาวะ แก้ไข้ ขับระดูในสตรี แก้ปวดข้อ แก้เหน็บชา โดยใช้รากแห้งมาต้มกับน้ำดื่มใช้แก้ปวดเอว ปวดข้อ แก้กระดูกสันหลังอักเสบ โดยใช้ส่วนต่างๆ ทั้งต้นมาตากให้แห้งแล้วนำมาต้มกับน้ำดื่ม ใช้แก้เริม งูสวัด'
    },
    {
      name: 'ปลาไหลเผือก',
      image: 'image/14.jpg',
      body: 'รากใช้เป็นยาบำรุงกำลัง บำรุงร่างกาย คนเดินป่านิยมกันนัก เพราะจะช่วยทำให้ร่างกายแข็งแรง อดทน ช่วยคลายอาการปวดเมื่อย ป้องกันและรักษาไข้ป่าในระหว่างการเดินทาง (ราก)ส่วนทางภาคใต้จะใช้ทั้งแก่นและรากนำมาต้มกับน้ำกินวันละ 3-4 ครั้ง และช่วงก่อนนอนเป็นยาโด๊ปชั้นยอดที่ช่วยบำรุงกำลังและบำรุงสมรรถภาพทางเพศ ทำให้เลือดไหลเวียนดี (แก่นและราก)'
    },
    {
      name: 'พังคี',
      image: 'image/15.webp',
      body: 'รากใช้เข้ายาแก้ไข้ โดยผสมกับสมุนไพรชนิดอื่นอีก 34 ชนิด ใช้ต้มกับน้ำดื่มแก้ไข้ (ราก) รากพังคีช่วยแก้อาการจุกเสียด แก้ท้องอืด ท้องขึ้น ท้องเฟ้อ ปวดท้อง ปวดแน่นท้อง ด้วยการใช้รากต้มกับน้ำดื่ม หรือใช้ภายนอกด้วยการนำมาฝนทาท้อง หรือใช้ฝนกับน้ำปูนใส ผสมกับมหาหิงคุ์และการบูรใช้ทาท้องเด็กอ่อนจะช่วยทำให้ผายลม หรือใช้รากพังคีผสมกับรากส่องฟ้าดงต้มกับน้ำดื่มก็ได้ (ราก)'
    },
    {
      name: 'มะคังแดง',
      image: 'image/16.webp',
      body: 'เนื้อไม้มีรสเย็นเฝื่อน ใช้ต้มกับน้ำดื่มเป็นยาแก้เลือดลมเดินไม่สะดวก แก้พิษโลหิตและน้ำเหลือง (เนื้อไม้)ใช้เป็นยาแก้ไข้ (ไม่ระบุส่วนที่ใช้) เนื้อไม้นำมาต้มกับน้ำดื่มเป็นยาแก้อาการปวดท้อง (เนื้อไม้) แก่นใช้ผสมกับมุ่ยขาว มุ่ยแดง หนามแท่ง เล็บแมว เงี่ยงปลาดุก เป็นยารักษามะเร็ง โรคกระเพาะอาหาร (แก่น)'
    },
    {
      name: 'สะค้าน',
      image: 'image/17.jpg',
      body: ' ไม้เถา ขนาดกลาง ลักษณะเถากลมเลื้อย พาดพันต้นไม้อื่น เถาอ่อนสีเขียว เถาแก่สีน้้าตาลเทา เนื้อใน เถามีหน้าตัดเป็นเส้นรัศมี สีขาว เปลือกค่อนข้างอ่อน ใบเดี่ยว ออกเรียงสลับ รูปรีแกมรูปใบหอก ปลายใบ แหลม โคนใบสอบ ผิวใบเรียบและเป็นมันทั้งสองด้าน ใบมีสีเขียวสด ดอก ช่อกระจุกออกตามซอกใบ มีขนาด เล็ก ผล'
    },
    {
      name: 'สารภีป่า',
      image: 'image/18.jpg',
      body: 'ตำรายาไทย เปลือก และดอก ใช้ถ่ายพยาธิ แก้บิด และแก้ไข้ตำรายาพื้นบ้านล้านนา ทั้งต้น ผสมสมุนไพรจำพวกประดง รวม 9 ชนิด ต้มน้ำดื่มรักษาโรคประดง'
    },
    {
      name: 'อบเชยไทย',
      image: 'image/19.jpg',
      body: 'เปลือกต้นและเนื้อไม้ มีรสเผ็ด หวานชุ่ม มีกลิ่นหอม เป็นยาร้อนออกฤทธิ์ต่อไต ม้าม และกระเพาะปัสสาวะ ใช้เป็นยาบำรุงร่างกาย ทำให้ร่างกายอบอุ่น ช่วยกระจายความเย็นในร่างกาย ทำให้เลือดหมุนเวียนดี (เปลือกต้นและเนื้อไม้)เปลือกต้นใช้ปรุงผสมเป็นยาหอมและยานัตถุ์ ทำให้สดชื่น แก้ปวดศีรษะ แก้อาการอ่อนเพลีย (เปลือกต้น)'
    },
    {
      name: 'เฉียงพร้านางแอ',
      image: 'image/20.jpg',
      body: 'ยาพื้นบ้านอีสานใช้ ลำต้น ฝนน้ำกินแก้ไข้ ต้มน้ำดื่มบำรุงร่างกาย เป็นยาเจริญอาหารสำหรับสตรีหลังคลอด ผสมลำต้นแคด เปลือกต้นตับเต่าต้น ต้มน้ำดื่ม แก้ผิดสำแดง (กินอาหารแสลงไข้ ทำให้โรคกำเริบ อาจมีอาการท้องเสีย)  เปลือกต้น ต้มน้ำอาบรักษาไข้ตัวร้อน แก่น ช่วยขับลม ระบายความร้อน แก่น ใช้ทำเครื่องจักสานตำรายาไทยใช้ เปลือกต้น รสฝาดเย็น แก้ไข้  '
    },
    {
      name: 'เถาเอ็นอ่อน',
      image: 'image/21.jpg',
      body: 'ราก เถา และใบมีรสขมเบื่อเอียน เป็นยาเย็น มีพิษ ออกฤทธิ์ต่อหัวใจและตับ ใช้เป็นยาฟอกเลือด (ราก, เถา, ใบ) เถานำมาต้มกินจะช่วยทำให้จิตใจชุ่มชื่น (เถา)เมล็ดมีรสขมเมา เป็นยาขับลมในลำไส้และในกระเพาะอาหาร ทำให้ผายและเรอ ช่วยแก้อาการจุกเสียดแน่นท้อง (เมล็ด)'
    },
    {
      name: 'เปราะหอม',
      image: 'image/22.jpg',
      body: 'การศึกษาฤทธิ์ทางเภสัชวิทยาพบว่า ว่านเปราะหอมหรือเปราะหอม มีฤทธิ์ในการต่อต้านอนุมูลอิสระ (หัว) ใช้เป็นยาแก้ปวดศีรษะ คลายเครียด ด้วยการใช้ทั้งหัวและใบนำมาโขลก ใส่น้ำพอชุ่ม แล้วเอาไปชุบนำมาใช้คลุมหัว หรือจะใช้เฉพาะหัวนำมาตำคั้นเอาน้ำไปผสมกับแป้งหรือว่านหูเสือ ก็จะได้แป้งดินสอพองไว้ทาขมับแก้อาการปวดศีรษะ (หัว, ใบ) ใช้เป็นยาบำรุงหัวใจ บำรุงประสาท ด้วยการใช้หัวผสมลงในยาหอม (หัว)'
    }                            
  ];
  const cardGrid = document.getElementById('card-grid');

  cardData.forEach(card => {
    const cardElement = document.createElement('div');
    cardElement.classList.add('card');
  
    const cardHead = document.createElement('div');
    cardHead.classList.add('card-head');
    cardHead.textContent = card.name;
  
    const cardImg = document.createElement('div');
    cardImg.classList.add('card-img');
    const img = document.createElement('img');
    img.src = card.image;
    img.alt = '';
  
    const cardBody = document.createElement('div');
    cardBody.classList.add('card-body');
    cardBody.textContent = card.body;
  
    cardImg.appendChild(img);
    cardElement.appendChild(cardHead);
    cardElement.appendChild(cardImg);
    cardElement.appendChild(cardBody);
  
    cardGrid.appendChild(cardElement);
  });
  
